app/controllers/application_controller.rb

  def authenticate(email, password)
    user = User.find_by_email(email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "rk@gmail.com"], ["LIMIT", 1]]