app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @task = Task.find(params[:task_id])
    @project = Project.find(params[:project_id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    comment = comment_params
    comment_text = comment[:comment_text]
    task_id = params[:task_id]
    @comment = Comment.create(comment_text: comment_text, task_id: task_id)
---
INSERT INTO "comments" ("comment_text", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment_text", "comment 1"], ["task_id", 8], ["created_at", "2019-12-25 05:21:27.252905"], ["updated_at", "2019-12-25 05:21:27.252905"]]

  def destroy
    Comment.find(params[:comment_id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]