app/controllers/projects_controller.rb

  def index
    user_id = session[:user_id]
    @projects = Project.where(user_id: user_id)
---
SELECT "projects"."id" FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]

  def show
    project_id = params[:id]
    @project = Project.find(project_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    project = project_params
    name = project[:name]
    description = project[:description]
    user_id = session[:user_id]
    @project = Project.create(name: name, description: description, user_id: user_id)
---
INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dfwvf"], ["description", "dw"], ["user_id", 1], ["created_at", "2019-12-25 16:54:17.211428"], ["updated_at", "2019-12-25 16:54:17.211428"]]

  def destroy
    Project.find(params[:id]).destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]