app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    task_id = params[:id]
    @task = Task.find(task_id)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @task = Task.new
    @project = Project.find(params[:project_id])

INSERT INTO "tasks" ("name", "description", "priority", "deadline", "status", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    task = task_params
    name = task[:name]
    description = task[:description]
    priority = task[:priority]
    deadline = task[:deadline]
    status = task[:status]
    project_id = params[:project_id]
    @task = Task.create(name: name, description: description, priority: priority, deadline: deadline, status: status, project_id: project_id)

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 8]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def destroy
    #@task.destroy
    Task.find(params[:task_id]).destroy