app/controllers/users_controller.rb

  def create
    user = user_params
    name = user[:name]
    email = user[:email]
    password = user[:password]
    password_digest = BCrypt::Password.create password
    @user = User.create(name: name, email: email, password_digest: password_digest)
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"